Var 
  a: array[1..40] of integer; 
  s, kol, i, n: integer;
Begin
  WriteLn('Введите количество элементов массива <=40'); 
  Readln(n); {вводим количество элементов массива} 
  
  WriteLn('Введите ', n, ' элементов массива:'); 
  for i := 1 to n do 
    Read(a[i]);
  ReadLn; {вводим массив}
  
  WriteLn('Исходный массив:');
  for i := 1 to n do {выводим массив по 10 элементов в строке} 
    if (i mod 10) = 0 then 
      WriteLn(a[i]:5) 
    else 
      Write(a[i]:5);
  WriteLn;
  
  kol := 0; {обнуляем количество элементов, кратных 3} 
  s := 0; {обнуляем начальное значение суммы элементов}
  
  for i := 1 to n do
    if (a[i] mod 3) = 0 then {если элемент кратен 3} 
    begin
      kol := kol + 1; {увеличиваем количество на 1} 
      s := s + a[i]; {добавляем элемент к сумме} 
    end;
    
  if kol = 0 then {если количество элементов равно нулю, то} 
    WriteLn('Элементов, удовлетворяющих условию, нет') 
  else 
    WriteLn('Среднее арифметическое ', kol:3,
      ' элементов, кратных 3 = ', (s / kol):7:2);
End.