Program ex;
Var 
  a: array[1..100] of integer; 
  i, n: integer;
Begin
  WriteLn('Введите количество элементов n <= 100');
  ReadLn(n);
  
  WriteLn('Введите ', n, ' элементов массива:');
  for i := 1 to n do 
    Read(a[i]);
  ReadLn;
  
  WriteLn('Исходный массив:');
  for i := 1 to n do 
    Write(a[i]:5); 
  WriteLn;
  
  i := 1; {начальное значение индекса массива}
  
  {ищем первый отрицательный элемент}
  while (a[i] >= 0) and (i < n) do 
    i := i + 1; {пока элемент не отрицателен и индекс меньше n - переходим к следующему элементу}
  
  if a[i] < 0 then {проверяем, действительно ли нашли отрицательный}
    WriteLn('Первый отрицательный элемент ', a[i]:5, ' имеет индекс ', i:4)
  else 
    WriteLn('Таких элементов в массиве нет.');
End.