Program ex;
Var 
  a: array[1..20] of Real; 
  i, j, n, k: integer; 
  b: real;
Begin
  WriteLn('Введите размер массива N <= 20:');
  ReadLn(n);
  
  for i := 1 to n do 
    Read(a[i]);
  ReadLn;
  
  WriteLn('Исходный массив:');
  for i := 1 to n do 
    Write(a[i]:7:2);
  WriteLn;
  
  k := 1; {количество перестановок, начальное значение не равно 0}
  i := 1; {номер очередного просмотра, в начале равен 1}
  
  while k <> 0 do {пока есть перестановки} 
  begin
    k := 0; {обнуляем количество перестановок}
    
    for j := 1 to n - i do {цикл сравнения соседних элементов}
      if a[j] > a[j + 1] then {если предыдущий элемент больше, то}
      begin {осуществляем перестановку}
        b := a[j];
        a[j] := a[j + 1];
        a[j + 1] := b;
        k := k + 1; {счетчик перестановок увеличиваем на 1}
      end;
    
    i := i + 1; {увеличиваем номер просмотра на 1}
  end;
  
  WriteLn('Отсортированный массив:');
  for i := 1 to n do 
    Write(a[i]:7:2);
  WriteLn;
  
  WriteLn('Количество проходов: ', i - 1:3);
End.