Program ex;
Var 
  x: array[1..100, 1..2] of real; 
  i, j, n, k: integer; 
  xk, S, w: real;
Begin
  Write('Введите количество отрезков: ');
  Readln(n);
  
  WriteLn('Вводите начала и концы отрезков:');
  for i := 1 to n do 
    ReadLn(x[i, 1], x[i, 2]);
  
  {сортировка отрезков по возрастанию левой границы}
  j := 1;
  repeat
    k := 0;
    for i := 1 to n - j do 
      if x[i, 1] > x[i + 1, 1] then
      begin 
        k := k + 1; {меняем отрезки местами}
        w := x[i, 1]; 
        x[i, 1] := x[i + 1, 1]; 
        x[i + 1, 1] := w; 
        
        w := x[i, 2]; 
        x[i, 2] := x[i + 1, 2]; 
        x[i + 1, 2] := w; 
      end;
    j := j + 1;
  until k = 0;
  
  {определение "тени" - суммарной длины объединения отрезков}
  S := x[1, 2] - x[1, 1]; {длина первого отрезка}
  xk := x[1, 2]; {правая граница первого отрезка}
  
  for i := 2 to n do
    if x[i, 1] >= xk then {случай 6 - отрезок не пересекается с предыдущими}
    begin 
      S := S + x[i, 2] - x[i, 1]; 
      xk := x[i, 2];
    end
    else if x[i, 2] > xk then {случай a - частичное перекрытие}
    begin 
      S := S + x[i, 2] - xk;
      xk := x[i, 2];
    end;
    {если x[i, 2] <= xk, то отрезок полностью внутри предыдущих - пропускаем}
  
  WriteLn('Длина тени равна ', S:6:2);
End.