Program sort2;
Var 
  a: array[0..20] of real; 
  B: real;
  i, j, n: integer;
Begin
  WriteLn('Введите количество чисел n <= 20:'); 
  ReadLn(n);
  
  WriteLn('Введите массив:');
  for i := 1 to n do 
    Read(a[i]);
  ReadLn;
  
  for i := 2 to n do {начиная со второго элемента до конца массива} 
  begin
    B := a[i]; {запоминаем i-й элемент}
    a[0] := B; {этот же элемент записываем в а[0] - это барьер}
    j := i - 1; {индекс предыдущего элемента запоминаем в j}
    
    while B < a[j] do {пока предыдущий элемент больше текущего}
    begin
      a[j + 1] := a[j]; {сдвигаем элемент вправо}
      j := j - 1; {уменьшаем j на 1}
    end;
    
    a[j + 1] := B; {как только найдено место, туда записывается В}
  end;
  
  WriteLn('Отсортированный массив:');
  for i := 1 to n do 
    Write(a[i]:6:2);
  WriteLn;
End.
