Program Strokal;
Var 
  ns1, ns2, ks, n1, n2, dl1, dl2, ns, dls, i, w: byte; 
  s, s1, s2: string;
Begin
  WriteLn('Введите исходную строку:'); 
  Readln(s); 
  
  ks := 0; {обнуляем счетчик слов} 
  for i := 1 to Length(s) do
    if (s[i] = ' ') or (i = length(s)) then {если конец очередного слова} 
      ks := ks + 1; {увеличиваем счетчик слов}
  
  WriteLn('Введите номера слов для обмена');
  ReadLn(n1, n2); {вводим номера}
  
  while (n1 > ks) or (n2 > ks) or (n1 = n2) do {пока номера не допустимы} 
  begin
    WriteLn('Количество слов в строке: ', ks:5);
    WriteLn('Одинаковые номера не допустимы.');
    WriteLn('Повторите ввод номеров.');
    ReadLn(n1, n2); {вводим номера} 
  end;
  
  if n1 > n2 then {сортируем номера по возрастанию}
  begin 
    w := n1; 
    n1 := n2; 
    n2 := w; 
  end;
  
  ns := 1; {начало первого слова равно 1} 
  dls := 0; {длина первого слова равна 0} 
  ks := 0; {номер слова пока равен 0}
  
  for i := 1 to Length(s) do {по всей строке} 
  begin
    if (s[i] = ' ') or (i = Length(s)) then {если слово завершено} 
    begin
      if (i = Length(s)) and (s[i] <> ' ') then {если в конце строки нет пробела}
        dls := dls + 1; {корректируем длину слова} 
      
      ks := ks + 1;
      
      if ks = n1 then {если это первое слово}
      begin {то запоминаем начало и длину} 
        ns1 := ns; 
        dl1 := dls; 
      end;
      
      if ks = n2 then {если это второе слово}
      begin {то запоминаем начало и длину} 
        ns2 := ns; 
        dl2 := dls; 
      end;
      
      dls := 0; {обнуляем длину текущего слова} 
      ns := i + 1; {запоминаем начало текущего слова} 
    end
    else 
      dls := dls + 1; {считаем длину очередного слова} 
  end;
  
  s1 := Copy(s, ns1, dl1); {копируем значение первого слова} 
  s2 := Copy(s, ns2, dl2); {копируем значение второго слова}
  
  Delete(s, ns2, dl2); {удаляем дальнее слово}
  Insert(s1, s, ns2); {вместо него вставляем ближнее}
  Delete(s, ns1, dl1); {удаляем ближнее слово}
  Insert(s2, s, ns1); {вставляем дальнее}
  
  WriteLn('Результат: ', s);
End.