Program stroka;
Var 
  st, strez, strab: string[40]; 
  c1, c2, c3, n, old, code: word;
   
Begin
  WriteLn('Введите строку. Завершение — ввод пустой строки.');
  ReadLn(st);
  
  while st <> '' do {цикл ввода, преобразования и вывода строк}
  begin
    c1 := Pos(' ', st); {определим местоположение первого пробела}
    strez := Copy(st, 1, c1 - 1) + '. '; {перепишем фамилию, инициал и добавим точку}
    
    strab := Copy(st, c1 + 1, Length(st) - c1); {копируем остаток строки в рабочее поле}
    
    c2 := Pos(' ', strab); {определяем местоположение второго пробела}
    strez := strez + strab[c2 - 1] + '. '; {добавляем к результату второй инициал и точку}
    
    Delete(strab, 1, c2); {удаляем распознанную часть}
    
    c3 := Pos(' ', strab); {определяем местоположение третьего пробела}
    Delete(strab, 1, c3); {удаляем остаток имени}
    
    Val(strab, n, code); {преобразуем год рождения в число}
    old := 2001 - n; {определяем возраст}
    Str(old, strab); {преобразуем возраст в строку}
    
    strez := strez + ' ' + strab; {добавляем возраст в результат}
    WriteLn(strez); {выводим результат}
    
    WriteLn('Введите строку. Завершение - ввод пустой строки.');
    ReadLn(st);
  end;
End.