Program Stroka3;
Var 
  ks, n1, n2, i, k: byte; 
  s, s1: string;
  MasStr: array[1..100] of string[20]; {рабочий массив}
Begin
  WriteLn('Введите исходную строку:'); 
  Readln(s); 
  
  ks := 0; {обнуляем счетчик слов}
  
  if s[length(s)] <> ' ' then 
    s := s + ' '; {если в конце строки нет пробела, то дописываем его}
  
  {разбор строки}
  while s <> '' do {пока в строке остались слова} 
  begin
    ks := ks + 1; {увеличиваем счетчик слов} 
    k := Pos(' ', s); {определяем конец слова} 
    
    if k > 0 then
    begin
      MasStr[ks] := Copy(s, 1, k); {копируем слово в массив}
      Delete(s, 1, k); {удаляем слово из строки}
    end
    else
    begin
      MasStr[ks] := s; {последнее слово без пробела}
      s := '';
    end;
  end;
  
  {обмен слов}
  WriteLn('Введите номера слов для обмена:');
  ReadLn(n1, n2); {вводим номера}
  
  while (n1 > ks) or (n2 > ks) or (n1 = n2) do {пока номера не допустимы} 
  begin
    WriteLn('Количество слов в строке: ', ks:5);
    WriteLn('Одинаковые номера не допустимы.');
    WriteLn('Повторите ввод номеров.');
    ReadLn(n1, n2); {вводим номера} 
  end;
  
  s1 := MasStr[n1]; {меняем слова местами}
  MasStr[n1] := MasStr[n2];
  MasStr[n2] := s1;
  
  {объединение слов в строку}
  s := ''; {очищаем строку}
  for i := 1 to ks do 
    s := s + MasStr[i]; {объединяем слова в строку}
  
  Delete(s, Length(s), 1); {удаляем пробел после последнего слова} 
  WriteLn('Результат: ', s); {выводим результат}
End.