Program Stroka;
Var 
  i, j, n: byte; 
  key: boolean;
  s: array [1..41] of char; {дополнительный символ - для точки}
Begin
  WriteLn('Введите исходную строку длиной до 40 символов:');
  
  i := 1; {вводим строку посимвольно до точки, но не более 40 символов}
  Read(s[i]);
  while (i < 40) and (s[i] <> '.') do 
  begin 
    i := i + 1;
    Read(s[i]);
  end;
  ReadLn;
  
  if s[i] = '.' then 
    n := i - 1 
  else 
    n := i; {определяем количество введенных символов без точки}
  
  Write('Введенная строка: '); 
  for i := 1 to n do
    Write(s[i]);
  WriteLn;
  
  j := 0; {номер символа в строке результата} 
  key := false; {гасим признак "первый пробел"} 
  
  for i := 1 to n do
    if s[i] = ' ' then {если обнаружен пробел} 
    begin
      if key then {этот пробел первый} 
      begin
        key := false; {дальше пойдут лишние пробелы} 
        j := j + 1; {пробел переписываем в результат} 
        s[j] := s[i]; 
      end;
    end
    else {символ} 
    begin
      key := true; {устанавливаем признак "первый пробел"}
      j := j + 1;
      s[j] := s[i]; {символ переписываем в результат} 
    end;
  
  if key then 
    j := j + 1; {если пробела в конце нет, то увеличиваем длину для записи точки}
  
  s[j] := '.'; {записываем точку}
  
  WriteLn('Преобразованная строка:'); 
  for i := 1 to j do 
    Write(s[i]); 
  WriteLn;
End.